In [1]:
import pandas as pd
import numpy as np
import scipy.stats as stats
from scipy.stats import shapiro

data=[8800, 9500, 9600, 10500, 10400, 9600, 10300, 9500, 9600, 7100, 10100, 7200]
data

[8800, 9500, 9600, 10500, 10400, 9600, 10300, 9500, 9600, 7100, 10100, 7200]

H0 : 진공관 수명은 1만시간이다.
H1 : 진공관 수명은 1만시간이 아니다.

In [2]:
s_mean=np.mean(data)
s_mean
u_var=np.var(data, ddof=1)
u_var

1282727.2727272727

In [3]:
shapiro(data)

ShapiroResult(statistic=0.8105747699737549, pvalue=0.012388509698212147)

귀무가설을 기각한다. 즉 정규성을 따르지 않는다.

In [4]:
np.median(data)

9600.0

In [5]:
from collections import Counter
Counter(data)

Counter({8800: 1,
         9500: 2,
         9600: 3,
         10500: 1,
         10400: 1,
         10300: 1,
         7100: 1,
         10100: 1,
         7200: 1})

In [6]:
while 9600 in data:
    data.remove(9600)

In [7]:
data=np.array(data)

In [8]:
mean0=10000
data
stats.wilcoxon(data-mean0, alternative='two-sided')

WilcoxonResult(statistic=11.0, pvalue=0.203125)

p-value가 0.05보다 크므로 귀무가설을 기각할 수 없다. 즉 진공관 수명시간은 1만시간이다

시제품의 평균 농도는 60이다./60이 아니다

In [9]:
data=pd.DataFrame({'data': [52,50,62,75,26,45,62,35,57,14]})
data

   data
0    52
1    50
2    62
3    75
4    26
5    45
6    62
7    35
8    57
9    14

In [10]:
np.median(data)

51.0

In [11]:
data.value_counts()

data
62      2
14      1
26      1
35      1
45      1
50      1
52      1
57      1
75      1
dtype: int64

In [12]:
mean0=60
stats.wilcoxon(data.data-mean0, alternative='two-sided')

WilcoxonResult(statistic=9.5, pvalue=0.064453125)

In [13]:
data=pd.DataFrame({'광고횟수':[1,2,3,4,5,7,8,9,11,12], '광고비':['낮음', '낮음', '낮음', '낮음', '높음', '높음', '높음', '높음', '높음', '높음'], '매출액':[15,16,17,18,20,22,24,26,28,29]})

In [14]:
data

   광고횟수 광고비  매출액
0     1  낮음   15
1     2  낮음   16
2     3  낮음   17
3     4  낮음   18
4     5  높음   20
5     7  높음   22
6     8  높음   24
7     9  높음   26
8    11  높음   28
9    12  높음   29

In [15]:
data=pd.get_dummies(data)
import numpy as np
import statsmodels.api as sm
import statsmodels.formula.api as smf
data

   광고횟수  매출액  광고비_낮음  광고비_높음
0     1   15       1       0
1     2   16       1       0
2     3   17       1       0
3     4   18       1       0
4     5   20       0       1
5     7   22       0       1
6     8   24       0       1
7     9   26       0       1
8    11   28       0       1
9    12   29       0       1

In [16]:
model=smf.ols(formula="매출액~광고횟수+매출액+광고비_낮음+광고비_높음", data=data)
result=model.fit()
result.summary()

C:\Users\taeeu\anaconda3\lib\site-packages\scipy\stats\stats.py:1541: UserWarning: kurtosistest only valid for n>=20 ... continuing anyway, n=10
  warnings.warn("kurtosistest only valid for n>=20 ... continuing "

<class 'statsmodels.iolib.summary.Summary'>
"""
                            OLS Regression Results
==============================================================================
Dep. Variable:                    매출액   R-squared:                       1.000
Model:                            OLS   Adj. R-squared:                  1.000
Method:                 Least Squares   F-statistic:                 7.189e+29
Date:                Sat, 24 Sep 2022   Prob (F-statistic):           4.71e-89
Time:                        08:58:22   Log-Likelihood:                 310.35
No. Observations:                  10   AIC:                            -612.7
Df Residuals:                       6   BIC:                            -611.5
Df Model:                           3
Covariance Type:            nonrobust
==============================================================================
                 coef    std err          t      P>|t|      [0.025      0.975]
------------------------------------------------------------------------------
Intercept   2.309e-14   7.67e-14      0.301      0.773   -1.64e-13    2.11e-13
광고횟수        5.329e-15   1.12e-14      0.477      0.650    -2.2e-14    3.27e-14
매출액            1.0000   8.53e-15   1.17e+14      0.000       1.000       1.000
광고비_낮음     -1.776e-15    3.7e-14     -0.048      0.963   -9.22e-14    8.87e-14
광고비_높음      3.553e-15   4.06e-14      0.087      0.933   -9.59e-14    1.03e-13
==============================================================================
Omnibus:                        1.950   Durbin-Watson:                   0.278
Prob(Omnibus):                  0.377   Jarque-Bera (JB):                0.848
Skew:                           0.174   Prob(JB):                        0.655
Kurtosis:                       1.617   Cond. No.                     2.38e+17
==============================================================================

Notes:
[1] Standard Errors assume that the covariance matrix of the errors is correctly specified.
[2] The smallest eigenvalue is 9.45e-32. This might indicate that there are
strong multicollinearity problems or that the design matrix is singular.
"""

학과와 성적은 독립이다

학과와 성적은 독립이아니다

In [17]:
data=pd.DataFrame({'사회과학':[15,60, 24], '자연과학':[25,69,6], '공학':[10, 77,14]}, index=['1.5-2.5', '2.5-3.5', '3.5-4.5'])

In [18]:
data

         사회과학  자연과학  공학
1.5-2.5    15    25  10
2.5-3.5    60    69  77
3.5-4.5    24     6  14

In [19]:
from scipy.stats import chi2_contingency
chi, p, df, expect=chi2_contingency(data)
p

0.0004531468852769105

귀무가설을 기각한다. 즉 성적과 학과는 독립이 아니다.

In [20]:
사회과학, 자연과학, 공학=data.sum()
사회과학, 자연과학, 공학

(99, 100, 101)

In [21]:
A, B, C=data.sum(axis=1)
A, B, C

(50, 206, 44)

In [22]:
n=사회과학+자연과학+공학
n

300

In [23]:
ad_ef=pd.DataFrame({'사회과학':[A*사회과학/n, B*사회과학/n, C*사회과학/n], '자연과학':[A*자연과학/n, B*자연과학/n, C*자연과학/n], '공학':[A*공학/n, B*공학/n, C*공학/n]}, index=data.index)

In [24]:
ad_ef

          사회과학       자연과학         공학
1.5-2.5  16.50  16.666667  16.833333
2.5-3.5  67.98  68.666667  69.353333
3.5-4.5  14.52  14.666667  14.813333

In [25]:
data, ad_ef

(         사회과학  자연과학  공학
 1.5-2.5    15    25  10
 2.5-3.5    60    69  77
 3.5-4.5    24     6  14,
           사회과학       자연과학         공학
 1.5-2.5  16.50  16.666667  16.833333
 2.5-3.5  67.98  68.666667  69.353333
 3.5-4.5  14.52  14.666667  14.813333)

In [26]:
y=((data-ad_ef)**2/ad_ef).sum().sum()
y

20.213713780910307

In [27]:
rv=stats.chi2(1)
1-rv.cdf(y)

6.925467610718883e-06

귀무가설을 기각한다. 즉 학과와 성적은 독립이 아니다.

In [28]:
data=pd.DataFrame({'data':[3.1, 3.3, 3.5, 3.7, 3.9, 4.1, 4.3, 4.4, 4.7]})
data

   data
0   3.1
1   3.3
2   3.5
3   3.7
4   3.9
5   4.1
6   4.3
7   4.4
8   4.7

In [29]:
n=9
rv=stats.t(df=n-1)
#95%, 0.05, 0.025,0.975
s_mean=np.mean(data.data)
u_var=np.var(data, ddof=1)
s_mean

3.8888888888888897

In [30]:
rv.isf(0.025)

2.306004135033371

In [31]:
lcl=s_mean-2.31*np.sqrt(u_var/n)
ucl=s_mean+2.31*np.sqrt(u_var/n)

In [32]:
lcl, ucl

(data    3.477021
 dtype: float64,
 data    4.300757
 dtype: float64)

In [33]:
A_norm=np.random.normal(5.7, 0.03, size=12)
B_norm=np.random.normal(5.6, 0.04, size=12)

In [34]:
stats.levene(A_norm, B_norm)

LeveneResult(statistic=0.02945347812910234, pvalue=0.8653049837022033)

기각할 수 없다. 즉 equal_var=True

In [35]:
stats.ttest_ind(A_norm, B_norm, equal_var=True)

Ttest_indResult(statistic=6.235292275351575, pvalue=2.8245519878647034e-06)

귀무가설을 기각한다. 즉 두 모평균의 사이의 차이는 있다.

6. 투자안별 투자금과 순 현재가치(NPV)

투자금을 1년 50억, 2년 60억, 3년 80억으로 예산을 설정했을때, 최대의 NPV는 얼마고 최적 투자안을 선정하라

In [52]:
from itertools import combinations
import pandas as pd

investment_df = pd.DataFrame([[23,23,15],
                              [15,15,12],
                              [17,25,12],
                              [16,12,13],
                              [24,23,17]],
                             index=[1,2,3,4,5], columns=['yr1', 'yr2', 'yr3'])

In [53]:
investment_df

   yr1  yr2  yr3
1   23   23   15
2   15   15   12
3   17   25   12
4   16   12   13
5   24   23   17

In [54]:
items = [1,2,3,4,5]
combination_list = list(combinations(items, 2)) + list(combinations(items,3))
result_df = pd.DataFrame()

In [55]:
for c in combination_list:
    temp_df = pd.DataFrame()
    
    for item in items:
        if item in c:
            temp_df = pd.concat([temp_df, investment_df.loc[item]], axis=1)
            
    result_df = pd.concat([result_df, temp_df.sum(axis=1)], axis=1)
    
result_df.columns = combination_list

In [61]:
temp_df

      3   4   5
yr1  17  16  24
yr2  25  12  23
yr3  12  13  17

In [57]:
df_t = result_df.T
df_t

           yr1  yr2  yr3
(1, 2)      38   38   27
(1, 3)      40   48   27
(1, 4)      39   35   28
(1, 5)      47   46   32
(2, 3)      32   40   24
(2, 4)      31   27   25
(2, 5)      39   38   29
(3, 4)      33   37   25
(3, 5)      41   48   29
(4, 5)      40   35   30
(1, 2, 3)   55   63   39
(1, 2, 4)   54   50   40
(1, 2, 5)   62   61   44
(1, 3, 4)   56   60   40
(1, 3, 5)   64   71   44
(1, 4, 5)   63   58   45
(2, 3, 4)   48   52   37
(2, 3, 5)   56   63   41
(2, 4, 5)   55   50   42
(3, 4, 5)   57   60   42

In [58]:
df_t = df_t[(df_t['yr1'] < 50) & (df_t['yr2'] < 60) & (df_t['yr3'] < 70)]
df_t

           yr1  yr2  yr3
(1, 2)      38   38   27
(1, 3)      40   48   27
(1, 4)      39   35   28
(1, 5)      47   46   32
(2, 3)      32   40   24
(2, 4)      31   27   25
(2, 5)      39   38   29
(3, 4)      33   37   25
(3, 5)      41   48   29
(4, 5)      40   35   30
(2, 3, 4)   48   52   37

In [59]:
df_t['total'] = df_t.sum(axis=1)
df_t.sort_values(by='total', ascending=False)

C:\Users\taeeu\anaconda3\lib\site-packages\pandas\core\frame.py:3607: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._set_item(key, value)

           yr1  yr2  yr3  total
(2, 3, 4)   48   52   37    137
(1, 5)      47   46   32    125
(3, 5)      41   48   29    118
(1, 3)      40   48   27    115
(2, 5)      39   38   29    106
(4, 5)      40   35   30    105
(1, 2)      38   38   27    103
(1, 4)      39   35   28    102
(2, 3)      32   40   24     96
(3, 4)      33   37   25     95
(2, 4)      31   27   25     83

In [74]:
investment_df.loc[[1,2]]
temp_df = pd.DataFrame()

In [75]:
temp_df=pd.concat([temp_df, investment_df.loc[[1,2]]], axis=1)
temp_df

   yr1  yr2  yr3
1   23   23   15
2   15   15   12

In [76]:
temp_df.sum(axis=1)

1    61
2    42
dtype: int64